Autodesk.Revit.DB.Structure.AnalyticalModelSupport.GetFace
Retrieves surface providing support,
Returns:
Surface representing the surface providing support, if the Support Type is Surface Support.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
Thrown when the Support Type is not Surface Support.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSupport.GetPoint
Retrieves the point providing support.
Returns:
Represents the point providing support, if the Support Type is Point Support.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
Thrown when the Support Type is not Point Support.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSupport.GetCurve
Retrieves the curve providing support.
Returns:
Represents the curve providing support, if the Support Type is Curve Support.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
Thrown when the Support Type is not Curve Support.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSupport.GetSupportingElement
Retrieves the actual Element Id providing support.
Returns:
Represents Element that provides support.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSupport.GetPriority
Retrieves the priority of the support provided.
Returns:
Indicates the support priority, as determined by Analytical Support Checking
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSupport.GetSupportType
Gets the type of support provided.
Returns:
Indicates type of support provided.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSupport.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.AnalyticalModelSupport
Represents one support for an Element, in the realm of the Analytical Model.
Remarks:
Analytical Support has been defined as if and how an Element is supported, by looking at
the Analytical Models of Elements.  There are different priorities of support, and different
types of support.  Additionally, even though an Element has supports, it may not be
fully supported.
Since:
2011